{
  "Header.Item1": "Über mich",
  "Header.Item2": "Erfahrung",
  "Header.Item3": "Projekte",
  "Header.Item4": "Kontakt",
  "Header.cvBtn": "Lebenslauf",
  "Header.cvName": "CV_Armughan_Ahmed.pdf",

  "Banner.Pretitle": "Hallo! Mein Name ist",
  "Banner.Description": "Ich bin ein Full Stack Entwickler mit über <span class='underline'>3 Jahren Erfahrung</span> in <br/><span class='underline'>.NET</span>, <span class='underline'>Angular</span>, <span class='underline'>Node.js</span>, <span class='underline'>Java</span>, <span class='underline'>Azure</span>, <span class='underline'>AWS</span>, <span class='underline'>Blockchain</span> und <span class='underline'>DevOps</span>.<br/><br/>Ich habe die Entwicklung mehrerer Projekte geleitet, deren Gesamtwert auf über <span class='underline'>8 Millionen Dollar</span> geschätzt wird.<br/><br/>Ich bin ein hochmotivierter Softwareingenieur, der mehrere hochwertige Softwareprodukte entwickelt, entworfen und gewartet hat.",
  "Banner.ActionBtn": "Kontaktieren Sie mich",

  "AboutMe.Title": "Über mich",
  "AboutMe.Paragraphs": [
    "Mit über <span class='underline'>3 Jahren</span> Erfahrung in der Full-Stack-Entwicklung habe ich zu zahlreichen Projekten beigetragen, die insgesamt einen Wert von über <span class='underline'>8 Millionen Dollar</span> haben.",
    "<span class='underline'>Y. Hata Kundenportal,</span> das von <a href='https://customers.microsoft.com/en-US/story/1506769038966204868-yhataandcolimited-visionetsystemsinc-dynamics365' target='_blank'><span class='underline'>Microsoft</span></a> unterstützt wurde, wurde in einem Artikel vorgestellt, der unsere Erfolgsgeschichte beschreibt. Außerdem habe ich an einem <a href='https://www.visionet.com/products/commerce/live-commerce' target='_blank'><span class='underline'>Live-Commerce</span></a>-Projekt mitgearbeitet, das von Microsoft unterstützt wurde.",
    "Ich habe Erfahrung in der Entwicklung und Infrastruktur von Anwendungen. Ich lege großen Wert darauf, wartbaren und verständlichen Code zu schreiben. Ich habe ein starkes Verständnis der Prinzipien des Software-Engineerings.",
    "Einige der Technologien, mit denen ich gearbeitet habe, umfassen (aber nicht beschränkt auf):"
  ],

  "Experience.Title": "Erfahrung",
  "Experience.Jobs": [
    {
      "Tab": "Systems Limited",
      "Title": "Beratender Entwickler",
      "Date": "Jul 2021 - Apr 2024",
      "Link": "https://www.systemsltd.com/",
      "Location": "Karachi, Pakistan",
      "Skills": [
        ".NET",
        "Spring Boot",
        "Angular",
        "PrimeNG",
        "Azure Functions",
        "Azure Service Bus",
        "SignalR",
        "SQL Server",
        "xUnit",
        "JUnit"
      ],
      "Description": [
        "Arbeitete an einem Kundenportal für einen Lebensmittellieferanten in Hawaii und erzielte eine bemerkenswerte <span class='underline'>5-fache</span> Leistungssteigerung im Vergleich zu ihrem alten ERP-System",
        "Entwickelte und erstellte eine Live-Streaming-Plattform für Verkäufer, auf der sie Live-Streams veranstalten können, um direkt an ein globales Publikum zu verkaufen",
        "Verbesserte die Inhaltslieferung durch <span class='underline'>Komprimieren, Kodieren und Transkodieren</span> von Videos in verschiedenen Formaten, um Inhalte effizienter bereitzustellen, mit Azure Media Services",
        "Reduzierte die Infrastrukturkosten um mehr als <span class='underline'>80%</span> durch die Implementierung einer serverlosen Architektur mit Azure Functions",
        "Implementierte <span class='underline'>Single Sign-On</span> und integrierte Azure AD mit MSAL",
        "Integrierte Microsoft Dynamics D365 unter Verwendung des <span class='underline'>OData-Protokolls</span> im Portal und erstellte CronJobs für die periodische Datensynchronisierung",
        "Entwickelte Frontend-Komponenten mit <span class='underline'>Angular 17</span> und verwendete modulare Design- und Smart&Dumb-Komponenten-Techniken",
        "Erstellte REST-APIs mit <span class='underline'>.NET 6</span> und <span class='underline'>Spring Boot 3</span>",
        "Bereitstellung der Anwendung nahtlos durch die <span class='underline'>Azure CI/CD</span> Pipeline",
        "Verbesserte die Datenabgleichsarchitektur, indem eine <span class='underline'>10-fache</span> Effizienz durch parallele Verarbeitung mit <span class='underline'>Azure Queue Service</span> und Entity Framework Bulk-Methoden erzielt wurde"
      ]
    },
    {
      "Tab": "iVolve",
      "Title": "DevOps Praktikant",
      "Date": "Feb 2021 - Jun 2021",
      "Link": "https://www.ivolve.io/",
      "Location": "Karachi, Pakistan",
      "Skills": [
        "Azure",
        "AWS",
        "GCP",
        "CI/CD",
        "Jenkins",
        "Docker",
        "Kubernetes",
        "Terraform",
        "Redis",
        "RabbitMQ"
      ],
      "Description": [
        "Arbeitete im Plattform-Team und trug zur Entwicklung der ersten privaten Cloud Pakistans bei",
        "Erstellte eine CI/CD-Pipeline für die QA-Umgebung unter Verwendung von Jenkins und Groovy Script",
        "Erstellte eine Infrastruktur als Code mit Terraform",
        "Erstellte Bereitstellungs- und Dienstdateien für Keycloak und stellte diese auf einem Kubernetes-Cluster bereit"
      ]
    },
    {
      "Tab": "Xord",
      "Title": "Blockchain Ingenieur",
      "Date": "Aug 2020 - Nov 2020",
      "Link": "https://www.xord.com/",
      "Location": "Karachi, Pakistan",
      "Skills": [
        "Node.js",
        "Nest.js",
        "TypeScript",
        "Solidity",
        "web3",
        "Openzeppelin",
        "MongoDB",
        "Chai",
        "Mocha"
      ],
      "Description": [
        "Erstellte ein Flash-Token-Smart-Contract mit Solidity 0.7.4 und Openzeppelin auf der Ethereum-Chain",
        "Erstellte Subgraphs mit The Graph Protocol zum Abfragen auf der Ethereum-Chain",
        "Erstellte einen Tweets-Scraper mit Python 3, der Tweets von XIO-Token-Inhabern, die am Flash-Staking-Wettbewerb teilgenommen haben, scrapte",
        "Erstellte einen XIO-Token-Verteilungs-Bot mit Node.js und Web3.js",
        "Führte Recherchen zu Gasgebühren-Optimierungen durch und schlug eine Layer-2-Lösung auf dem Matic-Netzwerk vor"
      ]
    }
  ],

  "FeatureProjects.Title": "Eigene Projekte",
  "FeatureProjects.Projects": [
    {
      "Title": "Blocktrade",
      "Description": "Blocktrade ist ein Supply-Chain-Management-System, das die Lieferkettenprozesse optimiert. Die Transaktionen werden auf einer privaten Blockchain, d.h. Hyperledger Fabric, aufgezeichnet und der Zustand wird mit CouchDB verwaltet. Smart Contracts werden mit Golang entwickelt.",
      "imgs": ["assets/images/blocktrade.png"],
      "ghLink": "https://www.github.com/armughanahmed/blocktrade",
      "Technologies": [
        "Node.js",
        "Express",
        "Golang",
        "React.js",
        "MySQL",
        "Hyperledger Fabric",
        "CouchDB",
        "Docker"
      ]
    }
  ],
  "Contact.Pretitle": "Was kommt als Nächstes?",
  "Contact.Title": "Melden Sie sich!",
  "Contact.Content": "Ich freue mich von Ihnen zu hören! Egal, ob Sie Fragen, Ideen oder Gesprächsmöglichkeiten haben, ich helfe Ihnen gerne weiter. Melden Sie sich noch heute, und ich werde Ihnen so schnell wie möglich antworten. Lassen Sie uns in Kontakt treten und gemeinsam etwas Großartiges schaffen!",
  "Contact.Btn": "Kontakt aufnehmen"
}
